
## Plan Result (aat)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 0 to change, 2 to destroy.</code></pre>

* Create
  * module.pcq-db-flexible.azurerm_monitor_action_group.db-alerts-action-group[0]
  * module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_cpu[0]
  * module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_memory[0]
  * module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0]
* Replace
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name
  * module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.pcq-db-flexible.azurerm_monitor_action_group.db-alerts-action-group[0] will be created
  + resource "azurerm_monitor_action_group" "db-alerts-action-group" {
      + enabled             = true
      + id                  = (known after apply)
      + location            = "global"
      + name                = "db_monitor_ag-pcq-backend-flexible-aat"
      + resource_group_name = "pcq-backend-flexible-data-aat"
      + short_name          = "db_monitor_a"
      + tags                = {
          + "application"         = "protected-characteristics-questionnaire"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pcq-backend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcq-dev"
          + "environment"         = "staging"
          + "managedBy"           = "PCQ"
        }

      + email_receiver {
          + email_address           = (sensitive value)
          + name                    = "Email Receiver"
          + use_common_alert_schema = true
        }
    }

  # module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_cpu[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_cpu" {
      + auto_mitigate            = true
      + description              = "Whenever the cpu utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_cpu_percent_pcq-backend-flexible-aat"
      + resource_group_name      = "pcq-backend-flexible-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-backend-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/pcq-backend-flexible-aat",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "protected-characteristics-questionnaire"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pcq-backend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcq-dev"
          + "environment"         = "staging"
          + "managedBy"           = "PCQ"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "cpu_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_memory[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_memory" {
      + auto_mitigate            = true
      + description              = "Whenever the memory utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_memory_percent_pcq-backend-flexible-aat"
      + resource_group_name      = "pcq-backend-flexible-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-backend-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/pcq-backend-flexible-aat",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "protected-characteristics-questionnaire"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pcq-backend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcq-dev"
          + "environment"         = "staging"
          + "managedBy"           = "PCQ"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "memory_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.pcq-db-flexible.azurerm_monitor_metric_alert.db_alert_storage_utilization[0] will be created
  + resource "azurerm_monitor_metric_alert" "db_alert_storage_utilization" {
      + auto_mitigate            = true
      + description              = "Whenever the storage utilization is greater than 80%"
      + enabled                  = true
      + frequency                = "PT5M"
      + id                       = (known after apply)
      + name                     = "db_storage_utilization_pcq-backend-flexible-aat"
      + resource_group_name      = "pcq-backend-flexible-data-aat"
      + scopes                   = [
          + "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcq-backend-flexible-data-aat/providers/Microsoft.DBforPostgreSQL/flexibleServers/pcq-backend-flexible-aat",
        ]
      + severity                 = 1
      + tags                     = {
          + "application"         = "protected-characteristics-questionnaire"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pcq-backend.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcq-dev"
          + "environment"         = "staging"
          + "managedBy"           = "PCQ"
        }
      + target_resource_location = (known after apply)
      + target_resource_type     = (known after apply)
      + window_size              = "PT15M"

      + action {
          + action_group_id = (known after apply)
        }

      + criteria {
          + aggregation            = "Average"
          + metric_name            = "storage_percent"
          + metric_namespace       = "Microsoft.DBforPostgreSQL/flexibleServers"
          + operator               = "GreaterThanOrEqual"
          + skip_metric_validation = false
          + threshold              = 80
        }
    }

  # module.sdp_db_user[0].data.azurerm_key_vault.sdp_vault will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault" "sdp_vault" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = (known after apply)
      + enabled_for_deployment          = (known after apply)
      + enabled_for_disk_encryption     = (known after apply)
      + enabled_for_template_deployment = (known after apply)
      + id                              = (known after apply)
      + location                        = (known after apply)
      + name                            = "mi-vault-dev"
      + network_acls                    = (known after apply)
      + public_network_access_enabled   = (known after apply)
      + purge_protection_enabled        = (known after apply)
      + resource_group_name             = "mi-dev-rg"
      + sku_name                        = (known after apply)
      + tags                            = (known after apply)
      + tenant_id                       = (known after apply)
      + vault_uri                       = (known after apply)
    }

  # module.sdp_db_user[0].data.azurerm_subscription.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_subscription" "current" {
      + display_name          = (known after apply)
      + id                    = (known after apply)
      + location_placement_id = (known after apply)
      + quota_id              = (known after apply)
      + spending_limit        = (known after apply)
      + state                 = (known after apply)
      + subscription_id       = (known after apply)
      + tags                  = (known after apply)
      + tenant_id             = (known after apply)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_name must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_name" {
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/pcq-backend-flexible-aat-read-user-name/68f8422558da457bb76e59795342695c" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> (known after apply) # forces replacement
        name                    = "pcq-backend-flexible-aat-read-user-name"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/pcq-backend-flexible-aat-read-user-name/versions/68f8422558da457bb76e59795342695c" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/pcq-backend-flexible-aat-read-user-name" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "68f8422558da457bb76e59795342695c" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/pcq-backend-flexible-aat-read-user-name" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sdp_db_user[0].azurerm_key_vault_secret.sdp_vault_sdp_read_user_password must be replaced
-/+ resource "azurerm_key_vault_secret" "sdp_vault_sdp_read_user_password" {
      ~ id                      = "https://mi-vault-dev.vault.azure.net/secrets/pcq-backend-flexible-aat-read-user-password/094a96fdcce744a4ac503ee02203896f" -> (known after apply)
      ~ key_vault_id            = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev" -> (known after apply) # forces replacement
        name                    = "pcq-backend-flexible-aat-read-user-password"
      ~ resource_id             = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/pcq-backend-flexible-aat-read-user-password/versions/094a96fdcce744a4ac503ee02203896f" -> (known after apply)
      ~ resource_versionless_id = "/subscriptions/867a878b-cb68-4de5-9741-361ac9e178b6/resourceGroups/mi-dev-rg/providers/Microsoft.KeyVault/vaults/mi-vault-dev/secrets/pcq-backend-flexible-aat-read-user-password" -> (known after apply)
      - tags                    = {} -> null
      ~ version                 = "094a96fdcce744a4ac503ee02203896f" -> (known after apply)
      ~ versionless_id          = "https://mi-vault-dev.vault.azure.net/secrets/pcq-backend-flexible-aat-read-user-password" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

Plan: 6 to add, 0 to change, 2 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1367,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->